// 3. Напишите программу, которая принимает на вход число (N)
// и выдаёт таблицу квадратов чисел от 1 до N.
void Method1 (int N)
{
int count = 0;
while (count<=N)
{
    Console.Write(count+" ");
    count++;
}
}

Method1(5);
Console.WriteLine();